{
  "item.armament.divine_axe_rhitta": "Divine Axe Rhitta",
  "item.armament.divine_axe_rhitta.lore": "\"A colossal battle axe imbued with the boundless power of the sun. Originally wielded by Lion Sin Escanor, the One who stands at the pinnacle of all races.\"",
  "item.armament.divine_axe_rhitta.ability.name.1": "Cruel Sun",
  "item.armament.divine_axe_rhitta.ability.desc.1": "Right click to summon a miniature sun that ignites all nearby mobs.",

  "item.armament.doomfist_gauntlet": "Doomfist's Gauntlet",
  "item.armament.doomfist_gauntlet.lore": "\"Wielded by a long line of Doomfists, it embodies raw power and ambition. With each devastating punch, it echoes dominance upon the battlefield.\"",
  "item.armament.doomfist_gauntlet.ability.name.1": "Rocket Punch",
  "item.armament.doomfist_gauntlet.ability.desc.1": "Charge up a forceful punch that launches the user forwards, transfer the user's kinetic energy into any opposing mobs within its radius.",

  "item.armament.event_horizon": "Event Horizon",
  "item.armament.event_horizon.lore": "\"This ornate lance, forged in the depths of a swirling vortex, holds within it the secrets of the cosmos. A miniature black hole, stabilized and contained, pulses with an otherworldly power at its core. Those who wield it must be prepared to dance with the very fabric of reality.\"",
  "item.armament.event_horizon.ability.name.1": "Singularity",
  "item.armament.event_horizon.ability.desc.1": "Right click to dislodge the black hole, allowing the user to manipulate it to their will, sucking in nearby mobs. Distance thrown is based on charge time.",

  "item.armament.jackpot": "Jackpot",
  "item.armament.jackpot.lore": "\"A whimsical hammer with a slot machine for a head, the Jackpot combines luck and strength in every swing.\"",
  "item.armament.jackpot.ability.name.1": "Fortune's Favor",
  "item.armament.jackpot.ability.desc.1": "Randomizes damage with each swing, delivering unpredictable power to your foes. Attack must be fully charged.",

  "item.armament.leaf_blower": "High-Power Leaf Blower",
  "item.armament.leaf_blower.lore": "\"A powerful yet lightweight tool for clearing debris with ease. Perfect for everyday yard work, it makes quick work of unwanted clutter.\"",
  "item.armament.leaf_blower.ability.name.1": "Powerful Motor",
  "item.armament.leaf_blower.ability.desc.1": "Push nearby entities away with force, ideal for clearing out areas quickly.",
  "item.armament.leaf_blower.on": "Leaf blower activated",
  "item.armament.leaf_blower.off": "Leaf blower deactivated",

  "item.armament.quantum_drill": "Quantum Drill",
  "item.armament.quantum_drill.lore": "\"A groundbreaking tool forged from the rarest cosmic elements, this drill utilizes quantum mechanics to enhance its mining speed. Each unique block nearby resonates with its energy, amplifying excavation capabilities.\"",
  "item.armament.quantum_drill.ability.name.1": "Adaptive Excavation",
  "item.armament.quantum_drill.ability.desc.1": "Mining speed increases based on the number of unique blocks around you, making resource gathering faster and more efficient.",

  "item.armament.supernova": "Supernova",
  "item.armament.supernova.lore": "\"Forged with the heart of a dying star, this sword hums with celestial energy. Within its hilt lay pure cosmic power, ready wreck destruction at any moment.\"",
  "item.armament.supernova.ability.name.1": "Starburst",
  "item.armament.supernova.ability.desc.1": "Does AoE damage to nearby mobs.",

  "item.armament.shadowstep": "Shadowstep",
  "item.armament.shadowstep.lore": "\"Coagulated in the depths of darkness, this blade grants its wielder the ability to meld with shadows, allowing for swift movement and surprise attacks. Its design is both elegant and deadly, perfectly balanced for precision strikes.\"",
  "item.armament.shadowstep.ability.name.1": "Backstab Mastery",
  "item.armament.shadowstep.ability.desc.1": "Right click at a target to teleport behind it, backstabs do 3x more damage.",
  "item.armament.shadowstep.invalid": "You cannot teleport there.",

  "item.armament.resonance_pickaxe": "Resonance Pickaxe",
  "item.armament.resonance_pickaxe.lore": "\"Crafted from otherworldly materials, this pickaxe harnesses the power of resonance to enhance mining efficiency. Its design allows it to harmonize with the unique frequencies of each block.\"",
  "item.armament.resonance_pickaxe.ability.name.1": "Tuned Mining",
  "item.armament.resonance_pickaxe.ability.desc.1": "Increases mining speed for specific blocks by syncing with their frequencies, allowing for quicker extraction and minimal effort.",

  "item.armament.terra_blade": "Terra Blade",
  "item.armament.terra_blade.lore": "\"A legendary weapon said to contain the essence of numerous swords, the Terra Blade holds unparalleled strength and power, forged to vanquish darkness and chaos from the world of Terraria.\"",
  "item.armament.terra_blade.ability.name.1": "Terra Wave",
  "item.armament.terra_blade.ability.desc.1": "Shoots out a powerful wave of sword energy.",

  "item.armament.terraton_hammer": "Terraton Hammer",
  "item.armament.terraton_hammer.lore": "\"Forged from the unyielding core of an ancient golem, this colossal hammer carries the weight of forgotten eons. Each strike echoes with the power of the earth, capable of shattering stone and bone alike. Wield it wisely, for its strength demands a heavy toll.\"",
  "item.armament.terraton_hammer.ability.name.1": "Colossal Blow",
  "item.armament.terraton_hammer.ability.desc.1": "Deal massive damage at the cost of movement and attack speed.",

  "item.armament.truthseeker": "Truthseeker",
  "item.armament.truthseeker.lore": "\"In the relentless pursuit of knowledge, its blade carves through the veil of ignorance, severing falsehoods and casting light into the darkest corners of understanding. Each swing carries the weight of unspoken truths, leaving a path of shattered illusions and unyielding clarity in its wake.\"",
  "item.armament.truthseeker.ability.name.1": "Sage's Tribute",
  "item.armament.truthseeker.ability.desc.1": "Gain 100% increased experience from all sources.",

  "item.armament.zeus_thunderbolt": "Thunderbolt",
  "item.armament.zeus_thunderbolt.lore": "\"Crafted by the hand of the mighty god Zeus, this thunderous weapon channels the fury of the heavens. Its crackling energy strikes with the force of a storm, bringing divine retribution upon all who stand before it.\"",
  "item.armament.zeus_thunderbolt.ability.name.1": "Hermes' Blessing",
  "item.armament.zeus_thunderbolt.ability.desc.1": "Gain increased movement speed.",
  "item.armament.zeus_thunderbolt.ability.name.2": "Wrath of Zeus",
  "item.armament.zeus_thunderbolt.ability.desc.2": "Pressing right click while shifting will summon a downpour of lightning bolts near the player.",
  "item.armament.zeus_thunderbolt.ability.name.3": "Torrent",
  "item.armament.zeus_thunderbolt.ability.desc.3": "Multiple thunderbolts can be launched at once",

  "rarity.armament.legendary": "§6LEGENDARY",
  "rarity.armament.mythic": "§dMYTHIC",
  "rarity.armament.fabled": "§cFABLED",

  "creativeTab.armament_tab": "Armament"
}
